In [348]:
import numpy as np
import pandas as pd

In [349]:
dict1 ={
    "name": ['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','delhi','bareilly','shamli']
    
}

In [350]:
df = pd.DataFrame(dict1)

In [351]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34     delhi
2  skillf     24  bareilly
3   shubh     17    shamli

In [352]:
df.to_csv('friends.csv')

In [353]:
df.to_csv('friends_index_false.csv', index=False)

In [354]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     34   delhi

In [355]:
df.tail(2)

     name  marks      city
2  skillf     24  bareilly
3   shubh     17    shamli

In [356]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [357]:
sarah = pd.read_csv('sarah.csv')

In [358]:
sarah

   Unnamed: 0  Train No  Speed      City
0           0     12438     34    rampur
1           1     34589    123     dehli
2           2      9875     56  bareilly
3           3    123467     78    shamli

**What is Pandas?**

*Pandas is an open source data anazlysis library written in python.*

*It leverage the power and speed of numpy to make data analysis and preprocessing.*

*It provides rich and highly robust data operations.*

**Pandas has two  types of data structures:**

*1st Series - It's one dimensional array with indexes, it stores a single column or row of data in a Dataframe*

*2nd Dataframe - It's a tabular spreadsheet like structure representing rows each of which contains one or multiple columns*

*A one-dimensional array capable of holding any type of data-Series*

*A two-dimensional data structure with columns of potentially different types of data- Dataframe*

In [359]:
ser = pd.Series(np.random.rand(34))

In [360]:
type(ser)           # Series pandas ka data structure hai jo 1D hota hai

pandas.core.series.Series

In [361]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [362]:
type(newdf)

pandas.core.frame.DataFrame

In [363]:
newdf.head()

          0         1         2         3         4
0  0.353795  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [364]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.525876    0.504988    0.513451    0.481784    0.497503
std      0.283958    0.288739    0.276203    0.303854    0.291867
min      0.008199    0.002552    0.000808    0.001462    0.003151
25%      0.299684    0.271566    0.287675    0.219611    0.238155
50%      0.541441    0.493899    0.520117    0.458842    0.491716
75%      0.768556    0.763756    0.751577    0.767253    0.737821
max      0.985121    0.997682    0.999471    0.999302    0.998713

In [365]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [366]:
newdf[0][0] = 'sarah'

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_18084\34257280.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = 'sarah'
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_18084\34257280.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'sarah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = 'sarah'

In [367]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [368]:
newdf.head()

          0         1         2         3         4
0     sarah  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [369]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [370]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [371]:
newdf.to_numpy()

array([['sarah', 0.21863171666480452, 0.45467616043561543,
        0.09920670291661693, 0.6950538081632487],
       [0.22318602464945092, 0.8211753322808174, 0.25000541460849723,
        0.309354936185693, 0.2766256922461424],
       [0.6799656239322444, 0.08060073243055943, 0.7567388976988478,
        0.20875787082474762, 0.5414445244211724],
       ...,
       [0.6868550599921269, 0.028255407965753432, 0.261486442027662,
        0.32140582005917817, 0.6888103746324307],
       [0.5812437535839642, 0.5767744024666162, 0.4941306206913252,
        0.20319023686499726, 0.21457139510739076],
       [0.19617184680997102, 0.9976823651969544, 0.7800872823774526,
        0.4203905148692678, 0.08270227616028769]], dtype=object)

In [372]:
newdf[0][0] = 0.3

In [373]:
newdf.head()

          0         1         2         3         4
0       0.3  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [374]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.223186,0.679966,0.535308,0.159924,0.433793,0.472275,0.043442,0.787022,0.779342,...,0.405317,0.558288,0.488519,0.554659,0.559281,0.03408,0.198603,0.686855,0.581244,0.196172
1,0.218632,0.821175,0.080601,0.146124,0.312426,0.817389,0.964772,0.567741,0.54508,0.086193,...,0.339297,0.828017,0.607802,0.169078,0.466474,0.458756,0.342422,0.028255,0.576774,0.997682
2,0.454676,0.250005,0.756739,0.358126,0.946023,0.553155,0.561775,0.58437,0.533014,0.195707,...,0.507354,0.437035,0.152139,0.737075,0.100372,0.631645,0.799971,0.261486,0.494131,0.780087
3,0.099207,0.309355,0.208758,0.653598,0.831102,0.02832,0.240633,0.723185,0.317034,0.86892,...,0.113857,0.844671,0.225919,0.42952,0.516507,0.890558,0.108768,0.321406,0.20319,0.420391
4,0.695054,0.276626,0.541445,0.710816,0.61176,0.990415,0.478641,0.561119,0.48031,0.023402,...,0.793441,0.064403,0.35671,0.281597,0.157004,0.522027,0.263044,0.68881,0.214571,0.082702

In [375]:
newdf.head()

          0         1         2         3         4
0       0.3  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [376]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.695054  0.099207  0.454676  0.218632       0.3
1    0.276626  0.309355  0.250005  0.821175  0.223186
2    0.541445  0.208758  0.756739  0.080601  0.679966
3    0.710816  0.653598  0.358126  0.146124  0.535308
4    0.611760  0.831102  0.946023  0.312426  0.159924
..        ...       ...       ...       ...       ...
329  0.522027  0.890558  0.631645  0.458756   0.03408
330  0.263044  0.108768  0.799971  0.342422  0.198603
331  0.688810  0.321406  0.261486  0.028255  0.686855
332  0.214571  0.203190  0.494131  0.576774  0.581244
333  0.082702  0.420391  0.780087  0.997682  0.196172

[334 rows x 5 columns]

In [377]:
newdf.head()

          0         1         2         3         4
0       0.3  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [378]:
type(newdf[0])

pandas.core.series.Series

In [379]:
newdf2 = newdf

In [380]:
newdf2[0][0] = 9783

In [381]:
newdf

            0         1         2         3         4
0        9783  0.218632  0.454676  0.099207  0.695054
1    0.223186  0.821175  0.250005  0.309355  0.276626
2    0.679966  0.080601  0.756739  0.208758  0.541445
3    0.535308  0.146124  0.358126  0.653598  0.710816
4    0.159924  0.312426  0.946023  0.831102  0.611760
..        ...       ...       ...       ...       ...
329   0.03408  0.458756  0.631645  0.890558  0.522027
330  0.198603  0.342422  0.799971  0.108768  0.263044
331  0.686855  0.028255  0.261486  0.321406  0.688810
332  0.581244  0.576774  0.494131  0.203190  0.214571
333  0.196172  0.997682  0.780087  0.420391  0.082702

[334 rows x 5 columns]

In [382]:
newdf.loc[0,0] = 654  # loc is used to access a group of rows and columns by labels or a boolean array.

In [383]:
newdf.head(2)

          0         1         2         3         4
0       654  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626

In [384]:
newdf.columns = list("ABCDE")

In [385]:
newdf.head(2)

          A         B         C         D         E
0       654  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626

In [386]:
newdf.loc[0,'A'] = 65445

In [387]:
newdf.head()

          A         B         C         D         E
0     65445  0.218632  0.454676  0.099207  0.695054
1  0.223186  0.821175  0.250005  0.309355  0.276626
2  0.679966  0.080601  0.756739  0.208758  0.541445
3  0.535308  0.146124  0.358126  0.653598  0.710816
4  0.159924  0.312426  0.946023  0.831102  0.611760

In [388]:
newdf = newdf.drop(0, axis=1)

KeyError: '[0] not found in axis'

In [ ]:
newdf.head()

          B         C         D         E
0  0.086003  0.324823  0.765474  0.580305
1  0.211525  0.904222  0.405960  0.990674
2  0.033231  0.741291  0.090124  0.049775
3  0.511309  0.720595  0.138874  0.380467
4  0.548544  0.341810  0.262177  0.117990

In [ ]:
newdf.loc[[1,2], ['C','D']]

          C         D
1  0.543316  0.684993
2  0.679574  0.458656

In [ ]:
newdf.head()

          A         B         C         D         E
0     65445  0.602510  0.488032  0.813909  0.210107
1  0.766744  0.406823  0.543316  0.684993  0.090694
2  0.365261  0.583619  0.679574  0.458656  0.808704
3  0.026772  0.534036  0.957191  0.574681  0.761906
4   0.57399  0.458398  0.142920  0.672271  0.254614

In [ ]:
newdf.loc[:, ['C','D']]

            C         D
0    0.488032  0.813909
1    0.543316  0.684993
2    0.679574  0.458656
3    0.957191  0.574681
4    0.142920  0.672271
..        ...       ...
329  0.005731  0.876164
330  0.386235  0.953249
331  0.986597  0.337091
332  0.350599  0.093562
333  0.043346  0.869043

[334 rows x 2 columns]

In [ ]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
3    0.026772  0.534036  0.957191  0.574681  0.761906
5    0.197939  0.544044  0.994522  0.602279  0.307239
6    0.273619  0.869374  0.303462  0.481632  0.783609
7    0.107837  0.622306  0.110155  0.431869  0.170649
9    0.163484  0.089112  0.206174  0.853757  0.274552
..        ...       ...       ...       ...       ...
326  0.125796  0.264129  0.745139  0.158165  0.128688
327  0.034778  0.192461  0.311708  0.497843  0.015742
328  0.020414  0.781906  0.596690  0.380049  0.068616
330  0.234279  0.245885  0.386235  0.953249  0.031594
331  0.158045  0.769808  0.986597  0.337091  0.867950

[91 rows x 5 columns]

In [ ]:
newdf.head(2)

          A         B         C         D         E
0     65445  0.602510  0.488032  0.813909  0.210107
1  0.766744  0.406823  0.543316  0.684993  0.090694

In [ ]:
newdf.iloc[0,4]

np.float64(0.2101067376925353)

In [ ]:
newdf.iloc[[0,5],[1,2]]

          C         D
0  0.324823  0.765474
5  0.939207  0.191714

In [ ]:
newdf.head(3)

          B         C         D         E
0  0.086003  0.324823  0.765474  0.580305
1  0.211525  0.904222  0.405960  0.990674
2  0.033231  0.741291  0.090124  0.049775

In [ ]:
newdf.drop([0])

            B         C         D         E
1    0.211525  0.904222  0.405960  0.990674
2    0.033231  0.741291  0.090124  0.049775
3    0.511309  0.720595  0.138874  0.380467
4    0.548544  0.341810  0.262177  0.117990
5    0.806872  0.939207  0.191714  0.088707
..        ...       ...       ...       ...
329  0.614632  0.590204  0.206109  0.928077
330  0.635465  0.603241  0.737732  0.470339
331  0.086215  0.885932  0.227678  0.376998
332  0.476240  0.159558  0.867495  0.337432
333  0.027711  0.475582  0.558220  0.822775

[333 rows x 4 columns]

In [ ]:
newdf.drop(['D','C'], axis=1)

            B         E
0    0.086003  0.580305
1    0.211525  0.990674
2    0.033231  0.049775
3    0.511309  0.380467
4    0.548544  0.117990
..        ...       ...
329  0.614632  0.928077
330  0.635465  0.470339
331  0.086215  0.376998
332  0.476240  0.337432
333  0.027711  0.822775

[334 rows x 2 columns]

In [ ]:
newdf.reset_index(drop=True, inplace=True)

In [ ]:
newdf.head(3)

          B         C         D         E
0  0.086003  0.324823  0.765474  0.580305
1  0.211525  0.904222  0.405960  0.990674
2  0.033231  0.741291  0.090124  0.049775

In [ ]:
newdf.loc[:, ['B']] = 34

In [ ]:
newdf.head()

    B         C         D         E
0  34  0.324823  0.765474  0.580305
1  34  0.904222  0.405960  0.990674
2  34  0.741291  0.090124  0.049775
3  34  0.720595  0.138874  0.380467
4  34  0.341810  0.262177  0.117990

In [390]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                    "toy": [np.nan,np.nan, np.nan],
                    "born":[pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [391]:
df.head()

     name  toy       born
0  Alfred  NaN        NaT
1  Batman  NaN 1940-04-25
2  Alfred  NaN        NaT

In [392]:
df.dropna()

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [393]:
df.dropna(how='all', axis=1)

     name       born
0  Alfred        NaT
1  Batman 1940-04-25
2  Alfred        NaT

In [394]:
df.drop_duplicates(subset=['name'], keep=False)

     name  toy       born
1  Batman  NaN 1940-04-25

In [395]:
df.shape

(3, 3)

In [397]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 204.0+ bytes

In [398]:
df['name'].value_counts(dropna=False)

name
Alfred    2
Batman    1
Name: count, dtype: int64

In [399]:
df['toy'].value_counts(dropna=False)

toy
NaN    3
Name: count, dtype: int64

In [400]:
df.notnull()

   name    toy   born
0  True  False  False
1  True  False   True
2  True  False  False

In [ ]:
#create a  dataframe which contains only integers with 3 rows and columns 
# run following dataframe methods on them:
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()

# **Solve this Quizz**